Осуществим подключение к бд

In [1]:
%load_ext sql
%sql sqlite:///lab_2.db

'Connected: None@lab_2.db'

In [ ]:
Создадим таблицу студентов, групп, городов и факультетов

In [2]:
%%sql 
drop table if exists Students;

CREATE TABLE Students 
(
    student_id integer primary key, 
    Name varchar(50),
    SecondName varchar(50), 
    Faculty_id integer,
    city_id integer,
    group_id integer,
    GPA number
);

drop table if exists Faculties;
CREATE TABLE Faculties
(
id integer primary key,
name varchar(50)
);

drop table if exists Groups; 
Create table Groups
(
id integer primary key,
name varchar(50)
);

drop table if exists Cities; 
Create table Cities
(
id integer primary key,
name varchar(50)
);

Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

## Задание 1 
Перепишите создание таблиц с учетом наличия внешних ключей

In [3]:
%%sql 

drop table if exists Faculties;
CREATE TABLE Faculties
(
id integer primary key,
name varchar(50)
);

drop table if exists Groups; 
Create table Groups
(
id integer primary key,
name varchar(50)
);

drop table if exists Cities; 
Create table Cities
(
id integer primary key,
name varchar(50)
);

drop table if exists Students;
pragma foreign_key = on;
CREATE TABLE Students 
(
    student_id integer primary key, 
    Name varchar(50),
    SecondName varchar(50), 
    Faculty_id integer,
    city_id integer,
    group_id integer,
    GPA number,
    FOREIGN KEY (Faculty_id) REFERENCES Faculties(id),
    FOREIGN KEY (city_id) REFERENCES Cities(id),
    FOREIGN KEY (group_id) REFERENCES Groups(id) 
);

Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

## Задание 2
Осуществить вставку во все таблицы с учетом правил на внешние ключи

In [4]:
%%sql
INSERT INTO Faculties (id,name) VALUES (11,'KIB');
INSERT INTO Faculties (id,name) VALUES (12,'IT');
INSERT INTO Faculties (id,name) VALUES (13,'Economy');

INSERT INTO Cities (id,name) VALUES (197,'Moscow');
INSERT INTO Cities (id,name) VALUES (5,'Makhachkala');
INSERT INTO Cities (id,name) VALUES (33,'Vladimir');

INSERT INTO Groups (id,name) VALUES (101,'KMBO-01');
INSERT INTO Groups (id,name) VALUES (102,'KMBO-02');
INSERT INTO Groups (id,name) VALUES (201,'TT-01');
INSERT INTO Groups (id,name) VALUES (301,'EK-01');

INSERT INTO Students (student_id,Name,SecondName,Faculty_id,group_id,city_id,GPA) VALUES (1,'Pavel','Spirin',11,101,33,4.2);
INSERT INTO Students (student_id,Name,SecondName,Faculty_id,group_id,city_id,GPA) VALUES (2,'Timofey','Kalugin',11,101,197,4);
INSERT INTO Students (student_id,Name,SecondName,Faculty_id,group_id,city_id,GPA) VALUES (3,'Nickolas','Evstasiev',11,102,197,4.5);
INSERT INTO Students (student_id,Name,SecondName,Faculty_id,group_id,city_id,GPA) VALUES (4,'Michael','Strizhenov',12,201,197,3.8);
INSERT INTO Students (student_id,Name,SecondName,Faculty_id,group_id,city_id,GPA) VALUES (5,'Maxim','Digussar',13,301,5,3.5);

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

## Задание 3
Вывести Имя Студента, Название его факультета, группы и города проживания

In [5]:
%%sql
SELECT s.Name,s.SecondName,f.name as Faculty,g.name as groupName,c.name as town
FROM Students s,Faculties f,Groups g,Cities c
Where Faculty_id = f.id and group_id = g.id and city_id = c.id

Done.

[('Pavel', 'Spirin', 'KIB', 'KMBO-01', 'Vladimir'),
 ('Timofey', 'Kalugin', 'KIB', 'KMBO-01', 'Moscow'),
 ('Nickolas', 'Evstasiev', 'KIB', 'KMBO-02', 'Moscow'),
 ('Michael', 'Strizhenov', 'IT', 'TT-01', 'Moscow'),
 ('Maxim', 'Digussar', 'Economy', 'EK-01', 'Makhachkala')]

## Задание 4
Вывести имена всех студентов, обучающихся на факультет IT из Воронежа.

In [6]:
%%sql
SELECT s.Name,s.SecondName,f.name as Faculty--,c.name as town
FROM Students s,Faculties f,Cities c
Where Faculty_id = f.id and city_id = c.id and  f.id =12 and c.id=197 /*add 'Voronesh' to table*/

Done.

[('Michael', 'Strizhenov', 'IT')]

## Задание 5
Для всевозможных пар (Факультет, Город) вывести количество студентов, соответствующее данной группе

In [7]:
%%sql
SELECT f.name AS FACULT, c.name AS TOWN, COUNT(s.student_id) as Avarage
FROM Students s,Faculties f,Cities c
Where Faculty_id = f.id and city_id = c.id 
GROUP BY  f.name ,c.name

Done.

[('Economy', 'Makhachkala', 1),
 ('IT', 'Moscow', 1),
 ('KIB', 'Moscow', 2),
 ('KIB', 'Vladimir', 1)]

## Задание 6 
Для всех групп вывести средний балл по группе для студентов, не проживающих в Москве, при условии, что количество таких студентов не менее 3

In [24]:
%%sql
SELECT g.name as Grouppp, AVG(s.GPA) as AVARAGE
FROM Students s, Groups g,Cities c
Where s.group_id=g.id and city_id = c.id and c.name <> 'Moscow'/*add requirement about town and amount of people*/
GROUP BY g.name Having Count (distinct s.Name)>0 /*change to >3 ,why names are broken of groups*/

Done.

[('EK-01', 3.5), ('KMBO-01', 4.2)]